<center> <h1>Universidad Nacional de San Agustín de Arequipa</h1> </center> 
<center> <h1>Escuela Profesional de Ingeniería de Telecomunicaciones</h1> </center> 

<center> <h1> </h1> </center> 

<center><img src="https://user-images.githubusercontent.com/19308295/115939517-f1c6fe80-a463-11eb-989c-812ab4942586.png" width="380" height="4200"></center>

<center> <h2>Ingeniero Renzo Bolivar - Docente DAIE</h2> </center>

<center> <h1>Asignatura : Computación 2</h1> </center> 
<center> <h1>Alumno : Willian Roy Canazas Rosas

![linea 1](https://user-images.githubusercontent.com/19308295/115926252-2b8a0c00-a448-11eb-9d9c-b43beaf0ff68.png)

<center> <h1>PANDAS</h1> </center>

![linea 1](https://user-images.githubusercontent.com/19308295/115926252-2b8a0c00-a448-11eb-9d9c-b43beaf0ff68.png)

# Descripción:

<div class="alert alert-info">

En este notebook se explicarán la librería **Pandas** escrita como extensión de **NumPy** para la manipulación y análisis de datos en el lenguaje de programación Python. 
    
</div>

# Objetivos:

 1. Familiarizarce con creación de la estructura de tabla de datos **DataFrame.**
 2. Manejo inicial de un **DataFrame.**
 3. Importando archivos ***csv*** y manipulación inicial en **Pandas.**



[1. Pandas](#1.-Pandas)<br>
[2. Creación de DataFrame](#2.-Creación-de-DataFrame)<br>
[3. DataFrame a partir de archivo CSV](#3.-DataFrame-a-partir-de-archivo-CSV)<br>
[4. Estadistica DataFrame](#4.-Estadistica-DataFrame)<br>

[EJEMPLOS](#EJEMPLOS)<br>
[EJERCICIOS](#EJERCICIOS)<br>
[BIBLIOGRAFÍA](#BIBLIOGRAFÍA)<br>

![linea 1](https://user-images.githubusercontent.com/19308295/115926252-2b8a0c00-a448-11eb-9d9c-b43beaf0ff68.png)

![640px-Pandas_logo svg](https://user-images.githubusercontent.com/19308295/119273971-1b925300-bbd3-11eb-9705-fa3a404af0e1.png)

## <font color=#33A5FF>****1. Pandas****<tfont>

<div class="well">
<strong>PanDaS  (Panel Data Set)</strong>  es una librería de Python para la <strong>ciencia de datos y Machine Learning</strong>, por muchas razones, ofrece estructuras de datos poderosas, expresivas y flexibles que facilitan la manipulación y análisis de datos. Entre las estructuras más utilizadas se encuentra el <strong>DataFrame</strong>.

<strong>Pandas</strong> es una librería de código abierto de Python que proporciona herramientas de análisis y manipulación de datos de alto rendimiento utilizando sus potentes estructuras de datos.
    
    
</div>

<div class="well">
La librería <strong>Pandas</strong> se desarrollo debido a la necesidad de tener una herramienta flexible de alto rendimiento para el análisis de datos, construido sobre Numpy. En Python se utiliza  <strong>pandas</strong> en Machine Learning para la manipulación y preparación de datos. 

Usando esta librería podemos lograr cinco pasos típicos en el procesamiento y análisis de datos, independientemente del origen de los datos:
</div>
     
    
   - Cargar
   - Preparar
   - Manipular
   - Modelar
   - Analizar

<div class="well">
    Caracteristicas principales de de la librería <strong>Pandas</strong>.
</div>   
   
   
   
   - Objeto DataFrame rápido y eficiente con indexación predeterminada y personalizada.
   - Alto rendimiento para cargar datos en objetos de datos en memoria desde diferentes formatos de archivo.
   - Alineación de datos y manejo integrado de datos faltantes.
   - Remodelación y giro de conjuntos de fechas.
   - Etiquetado, corte, indexación y subconjunto de grandes conjuntos de datos.
   - Las columnas de una estructura de datos se pueden eliminar o insertar.
   - Agrupa por datos para agregación y transformaciones.
   - Alto rendimiento de fusión y unión de datos.
   - Funcionalidad de la serie de tiempo.

## DataFrame

<div class="well">
Es una estructura de datos muy utilizada en <strong>pandas</strong>, es tabular bidimensional de tamaño variable y potencialmente heterogénea con ejes etiquetados (filas y columnas). 

Un <strong>DataFrame</strong>  es una estructura de datos bidimensional, es decir, los datos se alinean de forma tabular en filas y columnas. Pandas DataFrame consta de tres componentes principales:
</div>



   - Los datos
   - Las filas
   - Las columnas

![Pantas_DataFrame](https://user-images.githubusercontent.com/19308295/119273989-44b2e380-bbd3-11eb-96d1-bd7e8a928fd6.png)

<div class="alert alert-info">

Si hablamos de la estructura de un **DataFrame** es muy similar a la de una matriz. Pero en una matriz solamente se admiten valores numéricos, a diferencia de la matriz, en un **DataFrame** se puede incluir también datos alfanuméricos en su contenido. 


</div>

![linea 2](https://user-images.githubusercontent.com/19308295/115926262-2fb62980-a448-11eb-8189-c2f10e499944.png)

## <font color=#33A5FF>****2. Creación de DataFrame****<tfont>

In [21]:
import numpy as np
import pandas as pd
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

###  A partir de diccionarios de listas

In [2]:
#Datos
num={"x":[14,11,16], "y":[21,12,13]}
listanum = pd.DataFrame(num)
#Imprimir
print(listanum)
listanum.head()

    x   y
0  14  21
1  11  12
2  16  13

    x   y
0  14  21
1  11  12
2  16  13

In [3]:
num2 ={"Los Simpson":["Homer","Marge","Bart","Lisa","Maggie"],
                "Edad":[34,33,10,8,3,],
                "Posiciones":["P","M","H","I","J"]}
#DataFrame
listnum2 =pd.DataFrame(num2)
#Imprimir
print(listnum2)
listnum2.head()

  Los Simpson  Edad Posiciones
0       Homer    34          P
1       Marge    33          M
2        Bart    10          H
3        Lisa     8          I
4      Maggie     3          J

  Los Simpson  Edad Posiciones
0       Homer    34          P
1       Marge    33          M
2        Bart    10          H
3        Lisa     8          I
4      Maggie     3          J

In [4]:
#Imprimir
print(listnum2["Los Simpson"])

0     Homer
1     Marge
2      Bart
3      Lisa
4    Maggie
Name: Los Simpson, dtype: object

In [5]:
#Imprimir
listnum2["Edad"]

0    34
1    33
2    10
3     8
4     3
Name: Edad, dtype: int64

### A partir de un numpy array de 2D

In [6]:
array1 = pd.DataFrame(
       np.random.randint(5, size=(5,3)),
       index=['Primero','Segundo','Tercero','Cuarto','Quinto'],
       columns=['Velocidad', 'Temperatura','Presión']
)
array1.head()

         Velocidad  Temperatura  Presión
Primero          2            0        4
Segundo          2            0        0
Tercero          0            1        2
Cuarto           1            4        3
Quinto           3            2        3

In [7]:
print(array1.shape)
print(len(array1.index))

(5, 3)
5

![linea 2](https://user-images.githubusercontent.com/19308295/115926262-2fb62980-a448-11eb-8189-c2f10e499944.png)

## <font color=#33A5FF>****3. DataFrame a partir de archivo CSV****<tfont>

## CSV separado por comas:

Se adjunta un archivo `data.zip` a la practica, se debe crear la carpeta `data` con los archivos del `data.zip`.

In [8]:
#Archivo csv 
data = pd.read_csv("data/titanic_comma.csv")
#Leer las 10 primeras líneas
data.head(10)

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
5,"Anderson, Mr Harry",1st,47.00,male,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1
7,"Andrews, Mr Thomas, jr",1st,39.00,male,0
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.00,female,1
9,"Artagaveytia, Mr Ramon",1st,71.00,male,0

In [40]:
#Leer 10 ultimas líneas
data.tail(10)

                        Name PClass   Age     Sex  Survived
1303      Yasbeck, Mr Antoni    3rd  27.0    male         0
1304     Yasbeck, Mrs Antoni    3rd  15.0  female         1
1305      Youssef, Mr Gerios    3rd   NaN    male         0
1306     Zabour, Miss Hileni    3rd   NaN  female         0
1307     Zabour, Miss Tamini    3rd   NaN  female         0
1308      Zakarian, Mr Artun    3rd  27.0    male         0
1309  Zakarian, Mr Maprieder    3rd  26.0    male         0
1310        Zenni, Mr Philip    3rd  22.0    male         0
1311        Lievens, Mr Rene    3rd  24.0    male         0
1312          Zimmerman, Leo    3rd  29.0    male         0

In [9]:
#Imprimir en SPyder
print(data)

                                               Name PClass    Age     Sex  \
0                      Allen, Miss Elisabeth Walton    1st  29.00  female
1                       Allison, Miss Helen Loraine    1st   2.00  female
2               Allison, Mr Hudson Joshua Creighton    1st  30.00    male
3     Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  25.00  female
4                     Allison, Master Hudson Trevor    1st   0.92    male
...                                             ...    ...    ...     ...
1308                             Zakarian, Mr Artun    3rd  27.00    male
1309                         Zakarian, Mr Maprieder    3rd  26.00    male
1310                               Zenni, Mr Philip    3rd  22.00    male
1311                               Lievens, Mr Rene    3rd  24.00    male
1312                                 Zimmerman, Leo    3rd  29.00    male

      Survived
0            1
1            0
2            0
3            0
4            1
...        ...
1308         0
1309         0
1310         0
1311         0
1312         0

[1313 rows x 5 columns]

### CSV separado por tabulación

In [25]:
#CSV separado por comas
datos2 = pd.read_csv("data/titanic_tabs.csv", "\t")
#Leer las 10 primeras líneas
datos2.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [27]:
#CSV separado por comas
datos2 = pd.read_csv("data/titanic_tabs.csv", "\t")
#Leer 10 ultimas lÍneas
datos2.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
146,147,1,3,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,27.0,0,0,350043,7.7958,NaN,S
147,148,0,3,"Ford, Miss. Robina Maggie ""Ruby""",female,9.0,2,2,W./C. 6608,34.3750,NaN,S
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S
149,150,0,2,"Byles, Rev. Thomas Roussel Davids",male,42.0,0,0,244310,13.0000,NaN,S
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

![linea 2](https://user-images.githubusercontent.com/19308295/115926262-2fb62980-a448-11eb-8189-c2f10e499944.png)

## <font color=#33A5FF>****4. Estadistica DataFrame****<tfont>

<div class="well">
En <strong>Pandas</strong>  podemos hallar con pocos comandos de manera muy sencilla y rapida <strong>la estadistica</strong> de los datos de todo tipo de archivos. Comenzamos con archivos <code>csv</code>.   
</div>

In [38]:
#CSV separado por punto y coma
notas = pd.read_csv("data/notas.csv",";")
#Leer las 15 primeras líneas
notas.head(15)
#Imprimir toda la lista
#print(notas)

    Alumno  Nota1  Nota2  Nota3  Promedio
0    Maria   18.0     19     18        18
1     Jose    8.0     15     11        11
2     Juan   13.0     12     17        14
3     Luis   10.0     19     18        16
4   Carlos   16.0     12     10        13
5     Rosa    0.0     14     10         8
6    Jorge    9.0     11     19        13
7   Victor    6.0     13     10        10
8      Ana   18.0     19     11        16
9      Luz   14.0     20     16        17
10   Cesar    8.0     13     20        14
11  Carmen   14.0     10     14        13
12  Miguel   14.0     10     16        13
13   Julio   11.0     10     14        12
14   Jesus   12.0     13     10        12

In [36]:
#CSV separado por punto y coma
notas = pd.read_csv("data/notas.csv",";")
#Leer las 15 primeras líneas
#notas.head(15)
#Imprimir toda la lista
print(notas)

       Alumno  Nota1  Nota2  Nota3  Promedio
0       Maria   18.0     19     18        18
1        Jose    8.0     15     11        11
2        Juan   13.0     12     17        14
3        Luis   10.0     19     18        16
4      Carlos   16.0     12     10        13
5        Rosa    0.0     14     10         8
6       Jorge    9.0     11     19        13
7      Victor    6.0     13     10        10
8         Ana   18.0     19     11        16
9         Luz   14.0     20     16        17
10      Cesar    8.0     13     20        14
11     Carmen   14.0     10     14        13
12     Miguel   14.0     10     16        13
13      Julio   11.0     10     14        12
14      Jesus   12.0     13     10        12
15      Pedro    5.0     11     15        10
16     Manuel   15.0     20     20        18
17      Juana    8.0     13     10        10
18     Santos    7.0     17     14        13
19    Segundo    NaN      8     20        14
20       Jhon   10.0      8     10         9
21      David    7.0      8     10         8
22      Angel   18.0      9     11        13
23      Julia    7.0     11     18        12
24      Diego   20.0     18     18        19
25       Flor   12.0     10     13        12
26  Elizabeth   16.0     19     18        18
27     Daniel   18.0     13     16        16
28      Oscar   10.0      9     12        10
29       Ruth    9.0     11     12        11
30      Diana   16.0     13     14        14
31      Marco    9.0     14     16        13
32      Edwin    0.0     19     11        10
33     Javier    6.0     16     10        11
34     Walter   11.0     13     14        13
35  Francisco    5.0     10     20        12
36   Fernando   10.0     20     13        14
37   Milagros   18.0     14     11        14
38  Alejandro    9.0     17     14        13
39       Raul   20.0     18     16        18
40    Ricardo    9.0     17     17        14
41       Alex   10.0     10     20        13
42    Roberto   19.0     14     12        15
43      Edgar   15.0      0     19        11
44   Victoria    8.0     11     17        12
45    Eduardo   12.0     19     12        14
46      Mario   19.0     14     19        17
47      Jaime   18.0     19     15        17
48     Gloria   19.0     16     16        17
49     Andrea   14.0     17     19        17

`describe()` : muestra estadísticas de resumen para las columnas numéricas.

In [39]:
#Estadísticas del DataFrame
print("Estadisticas del DataFrame")
#Imprimir
notas.describe()

Estadisticas del DataFrame

           Nota1      Nota2      Nota3   Promedio
count  49.000000  50.000000  50.000000  50.000000
mean   11.836735  13.720000  14.720000  13.440000
std     5.075870   4.204177   3.434756   2.778636
min     0.000000   0.000000  10.000000   8.000000
25%     8.000000  11.000000  11.250000  12.000000
50%    11.000000  13.000000  14.500000  13.000000
75%    16.000000  17.000000  18.000000  15.750000
max    20.000000  20.000000  20.000000  19.000000

Para los datos numéricos, el índice del resultado incluirá **cantidad de datos** `count`, **media** `mean`, desviación estandar `std`, **valor mínimo** `min`, **valor máximo**,los percentiles inferior de 25% y el percentil superior de 75%.

### Media de las columnas DataFrame

In [41]:
#Media o Promedio
print("Media o Promedio de la columnas DataFrame")
#Imprimir
print(notas.mean())

Media o Promedio de la columnas DataFrame
Nota1       11.836735
Nota2       13.720000
Nota3       14.720000
Promedio    13.440000
dtype: float64

In [42]:
#Imprimir
notas.mean()

Nota1       11.836735
Nota2       13.720000
Nota3       14.720000
Promedio    13.440000
dtype: float64

### Correlación del DataFrame

In [43]:
#Correlación
print("Correlación")

#Imprimir
notas.corr()

Correlación

             Nota1     Nota2     Nota3  Promedio
Nota1     1.000000  0.154411  0.212137  0.762637
Nota2     0.154411  1.000000  0.008593  0.596004
Nota3     0.212137  0.008593  1.000000  0.549895
Promedio  0.762637  0.596004  0.549895  1.000000

### Cuenta los datos del DataFrame

In [46]:
#Contar los datos del DataFrame no nulos
print("Contar los datos del DataFrame")

#Imprimir
notas.count()

Contar los datos del DataFrame

Alumno      50
Nota1       49
Nota2       50
Nota3       50
Promedio    50
dtype: int64

### Valor más alto

In [48]:
#El valor más alto de cada columna del DF
print("El valor más alto de la columna del DataFrame")
#Imprimir
notas.max()

El valor más alto de la columna del DataFrame

Alumno      Walter
Nota1         20.0
Nota2           20
Nota3           20
Promedio        19
dtype: object

### Valor más bajo

In [49]:
#El valor mínimo de cada columna del DF
print("El valor minimo de la columna del DataFrame")
#Imprimir
notas.min()

El valor minimo de la columna del DataFrame

Alumno      Alejandro
Nota1             0.0
Nota2               0
Nota3              10
Promedio            8
dtype: object

### Mediana x Columna

In [50]:
#Mediana de cada columna del DF
print("La mediana de la columna del DataFrame")
#Imprimir
notas.mean()

La mediana de la columna del DataFrame

Nota1       11.836735
Nota2       13.720000
Nota3       14.720000
Promedio    13.440000
dtype: float64

### Desviación estándar x Columna

In [51]:
#La desviación estándar de cada columna del DF
print("La desviación estandar de la columna de DataFrame")
#Imprimir
notas.std()

La desviación estandar de la columna de DataFrame

Nota1       5.075870
Nota2       4.204177
Nota3       3.434756
Promedio    2.778636
dtype: float64

##  Seleccionar un índice o columna

Una de las funciones que son muy fáciles en **Pandas** es seleccionar los datos que deseas en comparación con seleccionar un valor de una lista o un diccionario. Puedes seleccionar una columna de manera muy fácil, solamente deberás indicar el índice de la misma.

In [52]:
#Seleccionar la primera columna del DF
print("La primera columna del DataFrame")
#Imprimir
notas.iloc[:,0]

La primera columna del DataFrame

0         Maria
1          Jose
2          Juan
3          Luis
4        Carlos
5          Rosa
6         Jorge
7        Victor
8           Ana
9           Luz
10        Cesar
11       Carmen
12       Miguel
13        Julio
14        Jesus
15        Pedro
16       Manuel
17        Juana
18       Santos
19      Segundo
20         Jhon
21        David
22        Angel
23        Julia
24        Diego
25         Flor
26    Elizabeth
27       Daniel
28        Oscar
29         Ruth
30        Diana
31        Marco
32        Edwin
33       Javier
34       Walter
35    Francisco
36     Fernando
37     Milagros
38    Alejandro
39         Raul
40      Ricardo
41         Alex
42      Roberto
43        Edgar
44     Victoria
45      Eduardo
46        Mario
47        Jaime
48       Gloria
49       Andrea
Name: Alumno, dtype: object

In [53]:
#Seleccionar dos columnas del DF
print("Las dos columnas del DataFrame")
#Imprimir
notas.iloc[:, 0:2]

Las dos columnas del DataFrame

       Alumno  Nota1
0       Maria   18.0
1        Jose    8.0
2        Juan   13.0
3        Luis   10.0
4      Carlos   16.0
5        Rosa    0.0
6       Jorge    9.0
7      Victor    6.0
8         Ana   18.0
9         Luz   14.0
10      Cesar    8.0
11     Carmen   14.0
12     Miguel   14.0
13      Julio   11.0
14      Jesus   12.0
15      Pedro    5.0
16     Manuel   15.0
17      Juana    8.0
18     Santos    7.0
19    Segundo    NaN
20       Jhon   10.0
21      David    7.0
22      Angel   18.0
23      Julia    7.0
24      Diego   20.0
25       Flor   12.0
26  Elizabeth   16.0
27     Daniel   18.0
28      Oscar   10.0
29       Ruth    9.0
30      Diana   16.0
31      Marco    9.0
32      Edwin    0.0
33     Javier    6.0
34     Walter   11.0
35  Francisco    5.0
36   Fernando   10.0
37   Milagros   18.0
38  Alejandro    9.0
39       Raul   20.0
40    Ricardo    9.0
41       Alex   10.0
42    Roberto   19.0
43      Edgar   15.0
44   Victoria    8.0
45    Eduardo   12.0
46      Mario   19.0
47      Jaime   18.0
48     Gloria   19.0
49     Andrea   14.0

In [55]:
#Seleccionar el valor de la primera fila y última columna del DF
print("El valor de la primera Fila(Alumno:Maria) y tercera columna(Nota2) del DF")
#Imprimir
notas.iloc[0][2]

El valor de la primera Fila(Alumno:Maria) y tercera columna(Nota2) del DF

19

In [56]:
#Seleccionar los valores de la primera fila del DF
print("Los valores de la primera fila del DF")
#Imprimir
notas.loc[0]

Los valores de la primera fila del DF

Alumno      Maria
Nota1        18.0
Nota2          19
Nota3          18
Promedio       18
Name: 0, dtype: object

In [57]:
#Seleccionar valores de la primera fila del DF
print("Los valores de la primera fila del DF")
#Imprimir con iloc
notas.iloc[0,:]

Los valores de la primera fila del DF

Alumno      Maria
Nota1        18.0
Nota2          19
Nota3          18
Promedio       18
Name: 0, dtype: object

![linea 2](https://user-images.githubusercontent.com/19308295/115926262-2fb62980-a448-11eb-8189-c2f10e499944.png)

## <font color=#33A5FF>****EJEMPLOS****<tfont>

### Explorando datos

In [58]:
#Cargamos un archivo CSV separado por punto y coma (importado por excel)
notas =pd.read_csv('data/notas.csv', ';')

In [59]:
notas.head()

   Alumno  Nota1  Nota2  Nota3  Promedio
0   Maria   18.0     19     18        18
1    Jose    8.0     15     11        11
2    Juan   13.0     12     17        14
3    Luis   10.0     19     18        16
4  Carlos   16.0     12     10        13

In [60]:
#Tamaño de tabla
notas.shape

(50, 5)

In [61]:
#Tipos de los datos de las columnas
notas.dtypes

Alumno       object
Nota1       float64
Nota2         int64
Nota3         int64
Promedio      int64
dtype: object

In [62]:
#Tipos de datos de la tabla
type(notas)

pandas.core.frame.DataFrame

In [63]:
#Nombres de las columnas
notas.columns

Index(['Alumno', 'Nota1', 'Nota2', 'Nota3', 'Promedio'], dtype='object')

### SubConjuntos
![subconjuntos](https://user-images.githubusercontent.com/19308295/119282515-8c4f6480-bbff-11eb-8432-581e44f4a2f0.png)

In [64]:
#Seleccionar el subconjunto con dos columnas del DF en orden 
notas.loc[:,['Promedio','Alumno']]

    Promedio     Alumno
0         18      Maria
1         11       Jose
2         14       Juan
3         16       Luis
4         13     Carlos
5          8       Rosa
6         13      Jorge
7         10     Victor
8         16        Ana
9         17        Luz
10        14      Cesar
11        13     Carmen
12        13     Miguel
13        12      Julio
14        12      Jesus
15        10      Pedro
16        18     Manuel
17        10      Juana
18        13     Santos
19        14    Segundo
20         9       Jhon
21         8      David
22        13      Angel
23        12      Julia
24        19      Diego
25        12       Flor
26        18  Elizabeth
27        16     Daniel
28        10      Oscar
29        11       Ruth
30        14      Diana
31        13      Marco
32        10      Edwin
33        11     Javier
34        13     Walter
35        12  Francisco
36        14   Fernando
37        14   Milagros
38        13  Alejandro
39        18       Raul
40        14    Ricardo
41        13       Alex
42        15    Roberto
43        11      Edgar
44        12   Victoria
45        14    Eduardo
46        17      Mario
47        17      Jaime
48        17     Gloria
49        17     Andrea

### Operando entre columnas

In [68]:
#Nueva columa a partir de Operación entre columnas
notas['Promedio 1 y 2'] = (notas['Nota1']+notas['Nota2'])/2
notas.head()

   Alumno  Nota1  Nota2  Nota3  Promedio  Promedio 1 y 2
0   Maria   18.0     19     18        18            18.5
1    Jose    8.0     15     11        11            11.5
2    Juan   13.0     12     17        14            12.5
3    Luis   10.0     19     18        16            14.5
4  Carlos   16.0     12     10        13            14.0

### Filtros
![filtros](https://user-images.githubusercontent.com/19308295/119282563-b6a12200-bbff-11eb-82ee-606fbfe2ac1b.png)

In [66]:
#FILTRAR Cuantos alumnos califican como excelencia Promedio mayores o igual a 18
#MÉTODO 1
notas.loc[notas.Promedio >= 18]

       Alumno  Nota1  Nota2  Nota3  Promedio  Promedio 1 y 2
0       Maria   18.0     19     18        18            18.5
16     Manuel   15.0     20     20        18            17.5
24      Diego   20.0     18     18        19            19.0
26  Elizabeth   16.0     19     18        18            17.5
39       Raul   20.0     18     16        18            19.0

In [67]:
#FILTRAR Cuantos alumnos califican como excelencia Promedio mayores o igual a 18
#MÉTODO 2
notas.loc[notas['Promedio'] >= 18]

       Alumno  Nota1  Nota2  Nota3  Promedio  Promedio 1 y 2
0       Maria   18.0     19     18        18            18.5
16     Manuel   15.0     20     20        18            17.5
24      Diego   20.0     18     18        19            19.0
26  Elizabeth   16.0     19     18        18            17.5
39       Raul   20.0     18     16        18            19.0

### Seleccionar Fila y Columnas
![seleccion](https://user-images.githubusercontent.com/19308295/119283031-590dd500-bc01-11eb-93db-ee8a79b00103.png)

In [69]:
#Asignando resultado a otro DataFrame, con una sola columna 'Alumno'
excelencia = notas.loc[notas['Promedio'] >= 18,['Alumno']]
excelencia

       Alumno
0       Maria
16     Manuel
24      Diego
26  Elizabeth
39       Raul

In [70]:
#Tipo de tabla creada
type(excelencia)

pandas.core.frame.DataFrame

In [71]:
#Cantidad de excelencia
excelencia.count()

Alumno    5
dtype: int64

In [72]:
len(excelencia)

5

![linea 2](https://user-images.githubusercontent.com/19308295/115926262-2fb62980-a448-11eb-8189-c2f10e499944.png)

## <font color=#33A5FF>****BIBLIOGRAFÍA****<tfont>

[1] Guía de pandas oficial https://pandas.pydata.org/docs/user_guide/index.html

[2] Python Pandas Tutorial: A Complete Introduction for Beginners https://bit.ly/2AQMQld

[3] Guía para pandas https://pybonacci.org/2014/05/30/pandas-i/

[4] Dataset variados https://www.kaggle.com/datasets

![linea 1](https://user-images.githubusercontent.com/19308295/115926252-2b8a0c00-a448-11eb-9d9c-b43beaf0ff68.png)